software/jekyll-org-converter/index.en.html
---
title: Jekyll Org Plugin
date: 2017-01-15 19:54:47
layout: default
lang: en
ref: software/jekyll-org-converter
permalink: /software/jekyll-org-converter/index.en.html
---
<div id="outline-container-orga1ce19d" class="outline-2">
<h2 id="orga1ce19d">What is This?</h2>
<div class="outline-text-2" id="text-orga1ce19d">
<p>
Add <a href="http://orgmode.org/">Org mode</a> support into Jekyll,
with Org-mode options as YAML Front Matter.
</p>

<p>
This library parse your org-mode file's <code>+OPTIONS</code>, and use as Jekyll YAML Front Matter.
Thus you don't need YAML Front Matter when you write articles/posts as Org file.
</p>
</div>
</div>
<div id="outline-container-org391bd48" class="outline-2">
<h2 id="org391bd48">Depends</h2>
<div class="outline-text-2" id="text-org391bd48">
<ul class="org-ul">
<li>jekyll</li>
<li>org-ruby</li>
</ul>
</div>
</div>
<div id="outline-container-orge90edd2" class="outline-2">
<h2 id="orge90edd2">Usage</h2>
<div class="outline-text-2" id="text-orge90edd2">
<ul class="org-ul">
<li>Download this files into your plugin directory ( normally, <code>_plugins</code> ).</li>
<li>(optional) Create <code>_html_tags.yml</code> into your top directory, if you want to custom tags.</li>
</ul>
</div>
</div>
<div id="outline-container-org81b2697" class="outline-2">
<h2 id="org81b2697">limitation</h2>
<div class="outline-text-2" id="text-org81b2697">
<p>
If you want to upload GitHub pages, you can't use any plugins.
Thus please consider other methods, simply export org file as html, and use jekyll as normal way.
</p>
</div>
</div>
<div id="outline-container-org7d8abc6" class="outline-2">
<h2 id="org7d8abc6">License</h2>
<div class="outline-text-2" id="text-org7d8abc6">
<pre class="example">
  Permission is hereby granted, free of charge, to any person obtaining a
  copy of this software and associated documentation files (the "Software"),
  to deal in the Software without restriction, including without limitation
  the rights to use, copy, modify, merge, publish, distribute, sublicense,
  and/or sell copies of the Software, and to permit persons to whom the
  Software is furnished to do so, subject to the following conditions:
  .
  The above copyright notice and this permission notice shall be included
  in all copies or substantial portions of the Software.
  .
  THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
  OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
  IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
  CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
  TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
  SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
</pre>
</div>
</div>
